Autodesk.Revit.DB.Plumbing.Pipe.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Creates a new pipe that connects two connectors. The new pipe will have the same diameter and system type as the start connector. If the connection fails, the method throws an exception.
document:
The document.
pipeTypeId:
The ElementId of the new pipe type.
levelId:
The level ElementId for the new pipe.
startConnector:
The first connector where the new pipe starts.
endConnector:
The second point of the new pipe.
Returns:
The pipe.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The pipe type pipeTypeId is not valid pipe type.
-or-
The level id levelId is not valid.
-or-
The connector is not a valid Piping connector.
-or-
The points of startConnector and endConnector are equal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2015

Autodesk.Revit.DB.Plumbing.Pipe.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.XYZ)
Creates a new pipe that connects to the connector. The new pipe will have the same diameter and system type as the connector. If the connection fails, the method throws an exception.
document:
The document.
pipeTypeId:
The ElementId of the new pipe type.
levelId:
The level id for the new pipe.
startConnector:
The first connector where the new pipe starts.
endPoint:
The second point of the new pipe.
Returns:
The pipe.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The pipe type pipeTypeId is not valid pipe type.
-or-
The level id levelId is not valid.
-or-
The connector is not a valid Piping connector.
-or-
The points of startConnector and endPoint are equal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2015